<a href="https://colab.research.google.com/github/estebanqui11/Esteban-Lautaro/blob/master/TP2/TP2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Código de inicialización
Este código permite inicializar las bibliotecas para usar SQLite en la máquina virtual de Google Colab. El código además elimina cualquier dato almacenado anteriormente en el archvio `ejemplos.db`. Es recomendable volver a correr el código cada vez que se comience con la resolución de un nuevo ejercicio.

In [1]:
!pip install pymysql
%load_ext sql
!rm -rf ejemplos.db
%sql sqlite:///ejemplos.db

Requirement already satisfied: pymysql in /usr/local/lib/python3.10/dist-packages (1.1.1)

# TP2: Ejercicios de SQL


## EJERCICIO 1:  Base de datos para un club náutico

### Descripción:
Se quiere diseñar una base de datos relacional para gestionar los datos de los socios de un club náutico. De cada socio se guardan los datos personales y la información de los barcos que posee:
- Número de matrícula, nombre, número de amarre, cuota.

Además, se almacena información sobre las salidas realizadas por cada barco:
- Fecha y hora de salida, destino y datos del patrón (que no tiene que ser el propietario ni un socio del club).

### Esquema propuesto:
- Tabla `Socios`: Almacena la información de los socios del club.
- Tabla `Barcos`: Almacena la información de los barcos y sus propietarios.
- Tabla `Salidas`: Almacena la información de las salidas realizadas por los barcos.

### Esquema de tablas
Este sería el esquema de tablas en lenguaje DBML

```dbml
Table Socios {
    id_socio INT [pk]
    nombre VARCHAR(100)
    direccion VARCHAR(255)
}

Table Barcos {
    matricula VARCHAR(20) [pk]
    nombre VARCHAR(100)
    numero_amarre INT
    cuota DECIMAL(10, 2)
    id_socio INT [ref: > Socios.id_socio]
}

Table Salidas {
    id_salida INT [pk]
    matricula VARCHAR(20) [ref: > Barcos.matricula]
    fecha_salida DATE
    hora_salida TIME
    destino VARCHAR(100)
    patron_nombre VARCHAR(100)
    patron_direccion VARCHAR(255)
}
```

### Escriba abajo el código SQL necesario para crear las tablas:

In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.35)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (71.0.4)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql sqlite://ejemplos.db

Traceback (most recent call last):
  File "/usr/local/lib/python3.10/dist-packages/sql/connection.py", line 45, in __init__
    engine = sqlalchemy.create_engine(
  File "<string>", line 2, in create_engine
  File "/usr/local/lib/python3.10/dist-packages/sqlalchemy/util/deprecations.py", line 281, in warned
    return fn(*args, **kwargs)  # type: ignore[no-any-return]
  File "/usr/local/lib/python3.10/dist-packages/sqlalchemy/engine/create.py", line 615, in create_engine
    (cargs_tup, cparams) = dialect.create_connect_args(u)
  File "/usr/local/lib/python3.10/dist-packages/sqlalchemy/dialects/sqlite/pysqlite.py", line 583, in create_connect_args
    raise exc.ArgumentError(
sqlalchemy.exc.ArgumentError: Invalid SQLite URL: sqlite://ejemplos.db
Valid SQLite URL forms are:
 sqlite:///:memory: (or, sqlite://)
 sqlite:///relative/path/to/file.db
 sqlite:////absolute/path/to/file.db

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///ejemplos.db'])
Traceback (most recent call last):
  File "/usr/local/lib/python3.10/dist-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
  File "/usr/local/lib/python3.10/dist-packages/sql/connection.py", line 70, in set
    cls.current = existing or Connection(descriptor, connect_args, creator)
  File "/usr/local/lib/python3.10/dist-packages/sql/connection.py", line 45, in __init__
    engine = sqlalchemy.create_engine(
  File "<string>", line 2, in create_engine
  File "/usr/local/lib/python3.10/dist-packages/sqlalchemy/util/deprecations.py", line 281, in warned
    return fn(*args, **kwargs)  # type: ignore[no-any-return]
  File "/usr/local/lib/python3.10/dist-packages/sqlalchemy/engine/create.py", line 615, in create_engine
    (cargs_tup, cparams) = dialect.create_connect_args(u)
  File "/usr/local/lib/python3.10/dist-packages/sqlalchemy/dialects/sqlite/pysqlite.py", line 583, in create_connect_args
    raise exc.ArgumentError(
sqlalchemy.exc.ArgumentError: Invalid SQLite URL: sqlite://ejemplos.db
Valid SQLite URL forms are:
 sqlite:///:memory: (or, sqlite://)
 sqlite:///relative/path/to/file.db
 sqlite:////absolute/path/to/file.db

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///ejemplos.db'])

In [5]:
%%sql
DROP TABLE IF EXISTS Asuntos_Procuradores;
DROP TABLE IF EXISTS Procuradores;
DROP TABLE IF EXISTS Asuntos;
DROP TABLE IF EXISTS Clientes;

CREATE TABLE Clientes (
    dni VARCHAR(10) PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    direccion VARCHAR(150)
);

CREATE TABLE Asuntos (
    numero_expediente INT PRIMARY KEY,
    dni_cliente VARCHAR(10),
    fecha_inicio DATE,
    fecha_fin DATE,
    estado VARCHAR(20),
    FOREIGN KEY (dni_cliente) REFERENCES Clientes(dni)
);

CREATE TABLE Procuradores (
    id_procurador INT PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    direccion VARCHAR(150)
);

CREATE TABLE Asuntos_Procuradores (
    numero_expediente INT,
    id_procurador INT,
    PRIMARY KEY (numero_expediente, id_procurador),
    FOREIGN KEY (numero_expediente) REFERENCES Asuntos(numero_expediente),
    FOREIGN KEY (id_procurador) REFERENCES Procuradores(id_procurador)
);
CREATE TABLE IF NOT EXISTS Socios (
    id_socio INT PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    direccion VARCHAR(150),
    telefono VARCHAR(15),
    email VARCHAR(100)
);

-- Tabla Barcos
CREATE TABLE IF NOT EXISTS Barcos (
    numero_matricula VARCHAR(15) PRIMARY KEY,
    nombre_barco VARCHAR(100),
    numero_amarre INT,
    cuota DECIMAL(10, 2),
    id_socio INT,
    FOREIGN KEY (id_socio) REFERENCES Socios(id_socio) -- Relación con los socios
);

-- Tabla Salidas
CREATE TABLE IF NOT EXISTS Salidas (
    id_salida INT PRIMARY KEY,
    numero_matricula VARCHAR(15),
    fecha_salida DATETIME,
    destino VARCHAR(100),
    nombre_patron VARCHAR(100),
    FOREIGN KEY (numero_matricula) REFERENCES Barcos(numero_matricula) -- Relación con los barcos
);

 * sqlite:///ejemplos.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [6]:
%%sql
-- Populación de las tablas
INSERT INTO Socios (id_socio, nombre, direccion)
VALUES
(1, 'Juan Pérez', 'Calle Mayor 1, Madrid'),
(2, 'Ana García', 'Calle Luna 5, Barcelona'),
(3, 'Luis Fernández', 'Avenida del Sol 10, Valencia'),
(4, 'Laura Sánchez', 'Plaza del Mar 3, Alicante'),
(5, 'Carlos López', 'Calle Río 8, Sevilla'),
(6, 'Marta Díaz', 'Calle de la Sierra 12, Zaragoza'),
(7, 'Pedro Gómez', 'Calle Nueva 20, Bilbao'),
(8, 'Lucía Jiménez', 'Calle Real 30, Madrid'),
(9, 'María Torres', 'Calle Verde 15, Málaga'),
(10, 'Fernando Martín', 'Calle Azul 25, Murcia');

INSERT INTO Barcos (matricula, nombre, numero_amarre, cuota, id_socio)
VALUES
('ABC123', 'El Viento', 12, 600.50, 1),
('DEF456', 'La Brisa', 8, 450.00, 2),
('GHI789', 'El Sol', 15, 700.00, 3),
('JKL012', 'El Mar', 10, 550.75, 4),
('MNO345', 'La Luna', 18, 620.30, 5),
('PQR678', 'El Horizonte', 20, 780.90, 6),
('STU901', 'El Amanecer', 5, 400.00, 7),
('VWX234', 'La Estrella', 7, 520.50, 8),
('YZA567', 'La Marea', 14, 480.75, 9),
('BCD890', 'El Océano', 6, 630.80, 10);

INSERT INTO Salidas (id_salida, matricula, fecha_salida, hora_salida, destino, patron_nombre, patron_direccion)
VALUES
(1, 'ABC123', '2023-07-15', '10:30:00', 'Mallorca', 'Patrón 1', 'Calle de la Playa 1, Palma'),
(2, 'DEF456', '2023-07-20', '09:00:00', 'Ibiza', 'Patrón 2', 'Avenida del Puerto 3, Valencia'),
(3, 'GHI789', '2023-07-22', '08:45:00', 'Menorca', 'Patrón 3', 'Calle de la Costa 10, Alicante'),
(4, 'JKL012', '2023-07-25', '11:15:00', 'Mallorca', 'Patrón 4', 'Plaza del Faro 5, Barcelona'),
(5, 'MNO345', '2023-08-01', '14:00:00', 'Formentera', 'Patrón 5', 'Calle del Puerto 20, Ibiza'),
(6, 'PQR678', '2023-08-05', '07:30:00', 'Mallorca', 'Patrón 6', 'Calle de las Olas 15, Palma'),
(7, 'STU901', '2023-08-10', '12:00:00', 'Ibiza', 'Patrón 7', 'Avenida de la Marina 7, Barcelona'),
(8, 'VWX234', '2023-08-12', '09:30:00', 'Cabrera', 'Patrón 8', 'Calle del Mar 12, Alicante'),
(9, 'YZA567', '2023-08-15', '10:00:00', 'Formentera', 'Patrón 9', 'Calle del Sol 4, Ibiza'),
(10, 'BCD890', '2023-08-20', '08:00:00', 'Menorca', 'Patrón 10', 'Plaza del Faro 2, Palma');

 * sqlite:///ejemplos.db
10 rows affected.
(sqlite3.OperationalError) table Barcos has no column named matricula
[SQL: INSERT INTO Barcos (matricula, nombre, numero_amarre, cuota, id_socio)
VALUES
('ABC123', 'El Viento', 12, 600.50, 1),
('DEF456', 'La Brisa', 8, 450.00, 2),
('GHI789', 'El Sol', 15, 700.00, 3),
('JKL012', 'El Mar', 10, 550.75, 4),
('MNO345', 'La Luna', 18, 620.30, 5),
('PQR678', 'El Horizonte', 20, 780.90, 6),
('STU901', 'El Amanecer', 5, 400.00, 7),
('VWX234', 'La Estrella', 7, 520.50, 8),
('YZA567', 'La Marea', 14, 480.75, 9),
('BCD890', 'El Océano', 6, 630.80, 10);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### Resolver estas consignas sin usar JOIN:
Estas consirgnas deben resolverse usando lo visto en la clase del lunes 16/09 antes de ver la parte de JOIN. Esto es: subconsultas, etc.
1. ¿Qué socios tienen barcos amarrados en un número de amarre mayor que 10?

In [7]:
%%sql
SELECT nombre
FROM Socios
WHERE id_socio IN (
    SELECT id_socio
    FROM Barcos
    WHERE numero_amarre > 10
);

 * sqlite:///ejemplos.db
Done.

[]

2. ¿Cuáles son los nombres de los barcos y sus cuotas de aquellos barcos cuyo socio se llama 'Juan Pérez'?

In [8]:
%%sql
SELECT nombre_barco, cuota
FROM Barcos
WHERE id_socio IN (
    SELECT id_socio
    FROM Socios
    WHERE nombre = 'Juan Pérez'
);

 * sqlite:///ejemplos.db
Done.

[]

3. ¿Cuántas salidas ha realizado el barco con matrícula 'ABC123'?

In [9]:
%%sql
SELECT COUNT(*) AS total_salidas
FROM Salidas
WHERE numero_matricula = 'ABC123';

 * sqlite:///ejemplos.db
Done.

[(0,)]

4. Lista los barcos que tienen una cuota mayor a 500 y sus respectivos socios.

In [10]:
%%sql
SELECT nombre_barco, cuota
FROM Barcos
WHERE cuota > 500;

 * sqlite:///ejemplos.db
Done.

[]

5. ¿Qué barcos han salido con destino a 'Mallorca'?

In [11]:
%%sql
SELECT numero_matricula, destino
FROM Salidas
WHERE destino = 'Mallorca';

 * sqlite:///ejemplos.db
Done.

[]

6. ¿Qué patrones (nombre y dirección) han llevado un barco cuyo socio vive en 'Barcelona'?

In [12]:
%%sql
SELECT nombre_patron
FROM Salidas
WHERE numero_matricula IN (
    SELECT numero_matricula
    FROM Barcos
    WHERE id_socio IN (
        SELECT id_socio
        FROM Socios
        WHERE direccion LIKE '%Barcelona%'
    )
);

 * sqlite:///ejemplos.db
Done.

[]

### Resolver nuevamentos los incisos, pero ahora usa JOIN
1. ¿Qué socios tienen barcos amarrados en un número de amarre mayor que 10?

In [13]:
%%sql
SELECT s.id_socio, s.nombre, s.direccion
FROM Socios s
JOIN Barcos b ON s.id_socio = b.id_socio
WHERE b.numero_amarre > 10;

 * sqlite:///ejemplos.db
Done.

[]

2. ¿Cuáles son los nombres de los barcos y sus cuotas de aquellos barcos cuyo socio se llama 'Juan Pérez'?

In [14]:
%%sql
SELECT b.nombre_barco, b.cuota
FROM Barcos b
JOIN Socios s ON b.id_socio = s.id_socio
WHERE s.nombre = 'Juan Pérez';

 * sqlite:///ejemplos.db
Done.

[]

3. ¿Cuántas salidas ha realizado el barco con matrícula 'ABC123'?

In [15]:
%%sql
SELECT COUNT(*) AS total_salidas
FROM Salidas s
JOIN Barcos b ON s.numero_matricula = b.numero_matricula
WHERE b.numero_matricula = 'ABC123';

 * sqlite:///ejemplos.db
Done.

[(0,)]

4. Lista los barcos que tienen una cuota mayor a 500 y sus respectivos socios.

In [16]:
%%sql
SELECT b.nombre_barco, b.cuota, s.nombre AS nombre_socio, s.direccion
FROM Barcos b
JOIN Socios s ON b.id_socio = s.id_socio
WHERE b.cuota > 500;

 * sqlite:///ejemplos.db
Done.

[]

5. ¿Qué barcos han salido con destino a 'Mallorca'?

In [17]:
%%sql
SELECT b.nombre_barco, b.numero_matricula
FROM Barcos b
JOIN Salidas s ON b.numero_matricula = s.numero_matricula
WHERE s.destino = 'Mallorca';

 * sqlite:///ejemplos.db
Done.

[]

6. ¿Qué patrones (nombre y dirección) han llevado un barco cuyo socio vive en 'Barcelona'?

In [25]:
%%sql
SELECT s.nombre AS nombre_patron, s.direccion
FROM Salidas sa
JOIN Barcos b ON sa.numero_matricula = b.numero_matricula
JOIN Socios s ON b.id_socio = s.id_socio
WHERE s.direccion LIKE '%Barcelona%';

 * sqlite:///ejemplos.db
Done.

[]


## EJERCICIO 2: Base de datos para un gabinete de abogados

### Descripción:
Se quiere diseñar una base de datos relacional para almacenar información sobre los asuntos que lleva un gabinete de abogados. Cada asunto tiene un número de expediente que lo identifica y corresponde a un solo cliente. Del asunto se debe almacenar:
- Período (fecha de inicio y fecha de archivo o finalización)
- Estado (en trámite, archivado, etc.)
- Datos personales del cliente (DNI, nombre, dirección, etc.)

Algunos asuntos son llevados por uno o varios procuradores, de los que nos interesa también almacenar los datos personales.

### Esquema propuesto:
- Tabla `Clientes`: Almacena la información de los clientes: dni (clave primaria), nombre y dirección.
- Tabla `Asuntos`: Almacena la información de los asuntos: numero de expediente (clave primaria), dni del cliente (clave externa), fecha de inicio, fecha de fin y estado (Abierto o Cerrado). Si el asunto está abierto, no tiene fecha de fin.
- Tabla `Procuradores`: Almacena la información de los procuradores: id del procurador (clave priaria), nombre y dirección.
- Tabla `Asuntos_Procuradores`: Relaciona los asuntos con los procuradores (muchos a muchos).

### SQL para crear las tablas:

In [19]:
%%sql

-- Tabla Clientes
CREATE TABLE Clientes (
    dni VARCHAR(10) PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    direccion VARCHAR(150)
);

-- Tabla Asuntos
CREATE TABLE Asuntos (
    numero_expediente INT PRIMARY KEY,
    dni_cliente VARCHAR(10),
    fecha_inicio DATE,
    fecha_fin DATE,
    estado VARCHAR(20),
    FOREIGN KEY (dni_cliente) REFERENCES Clientes(dni)
);

-- Tabla Procuradores
CREATE TABLE Procuradores (
    id_procurador INT PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    direccion VARCHAR(150)
);

-- Tabla Asuntos_Procuradores (relación muchos a muchos)
CREATE TABLE Asuntos_Procuradores (
    numero_expediente INT,
    id_procurador INT,
    PRIMARY KEY (numero_expediente, id_procurador),
    FOREIGN KEY (numero_expediente) REFERENCES Asuntos(numero_expediente),
    FOREIGN KEY (id_procurador) REFERENCES Procuradores(id_procurador)
);

 * sqlite:///ejemplos.db
(sqlite3.OperationalError) table Clientes already exists
[SQL: -- Tabla Clientes
CREATE TABLE Clientes (
    dni VARCHAR(10) PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    direccion VARCHAR(150)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [20]:
%%sql
-- Poblar la tabla Clientes
INSERT INTO Clientes (dni, nombre, direccion)
VALUES
('123456789', 'Juan Pérez', 'Calle Pueyrredón 3498, Buenos Aires'),
('987654321', 'Ana García', 'Calle 5 323, La Plata'),
('456123789', 'Luis Fernández', 'Avenida de Gral. Paz 1056, Bahía Blanca');

-- Poblar la tabla Asuntos
INSERT INTO Asuntos (numero_expediente, dni_cliente, fecha_inicio, fecha_fin, estado)
VALUES
(1, '123456789', '2023-01-15', '2023-07-20', 'Cerrado'),
(2, '987654321', '2023-05-10', NULL, 'Abierto'),
(3, '456123789', '2023-06-01', '2023-09-10', 'Cerrado');

-- Poblar la tabla Procuradores
INSERT INTO Procuradores (id_procurador, nombre, direccion)
VALUES
(1, 'Laura Sánchez', 'Calle Soler 3765, Buenos Aires'),
(2, 'Carlos López', 'Calle Estrellas 8, Mar del Plata'),
(3, 'Marta Díaz', 'Calle Estación 12, Olavarria');

-- Poblar la tabla Asuntos_Procuradores
INSERT INTO Asuntos_Procuradores (numero_expediente, id_procurador)
VALUES
(1, 1),
(2, 2),
(3, 3),
(2, 1);  -- Un asunto puede tener varios procuradores

 * sqlite:///ejemplos.db
3 rows affected.
3 rows affected.
3 rows affected.
4 rows affected.

[]

### Resolver estas consignas usando _únicamente_ JOIN en las consultas:
1. ¿Cuál es el nombre y la dirección de los procuradores que han trabajado en un asunto abierto?

In [21]:
%%sql
SELECT DISTINCT p.nombre, p.direccion
FROM Procuradores p
JOIN Asuntos_Procuradores ap ON p.id_procurador = ap.id_procurador
JOIN Asuntos a ON ap.numero_expediente = a.numero_expediente
WHERE a.estado = 'Abierto';

 * sqlite:///ejemplos.db
Done.

[('Carlos López', 'Calle Estrellas 8, Mar del Plata'),
 ('Laura Sánchez', 'Calle Soler 3765, Buenos Aires')]

2. ¿Qué clientes han tenido asuntos en los que ha participado el procurador Carlos López?

In [22]:
%%sql
SELECT DISTINCT c.nombre
FROM Clientes c
JOIN Asuntos a ON c.dni = a.dni_cliente
JOIN Asuntos_Procuradores ap ON a.numero_expediente = ap.numero_expediente
JOIN Procuradores p ON ap.id_procurador = p.id_procurador
WHERE p.nombre = 'Carlos López';

 * sqlite:///ejemplos.db
Done.

[('Ana García',)]

3. ¿Cuántos asuntos ha gestionado cada procurador?

In [23]:
%%sql
SELECT p.nombre, COUNT(ap.numero_expediente) AS cantidad_asuntos
FROM Procuradores p
LEFT JOIN Asuntos_Procuradores ap ON p.id_procurador = ap.id_procurador
GROUP BY p.id_procurador;

 * sqlite:///ejemplos.db
Done.

[('Laura Sánchez', 2), ('Carlos López', 1), ('Marta Díaz', 1)]

4. Lista los números de expediente y fechas de inicio de los asuntos de los clientes que viven en Buenos Aires.

In [24]:
%%sql
SELECT a.numero_expediente, a.fecha_inicio
FROM Asuntos a
JOIN Clientes c ON a.dni_cliente = c.dni
WHERE c.direccion LIKE '%Buenos Aires%';

 * sqlite:///ejemplos.db
Done.

[(1, '2023-01-15')]

# Entrega
La entrega consiste en completar esta hoja y subirla a su repositorio GIT
Se deben entregar también los diagramas de esquema de tablas como imagenes aparte.
Fecha límite: 30 de septiembre a las 23:59 hs